#### Terraform Format and Style: `failure`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>
```

terraform
aws_key_pair.rdx_key: Refreshing state... [id=rdx-key]
data.aws_ami.ubuntu: Reading...
data.aws_availability_zones.available: Reading...
aws_vpc.rdx_vpc: Refreshing state... [id=vpc-01be0f986a7878346]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
data.aws_ami.ubuntu: Read complete after 1s [id=ami-0778521d914d23bc1]
aws_security_group.rdx_private_security_group: Refreshing state... [id=sg-0fbd274ea9da10132]
aws_subnet.rdx_private_subnet[0]: Refreshing state... [id=subnet-0f617db90acf7f670]
aws_subnet.rdx_public_subnet[0]: Refreshing state... [id=subnet-0f213ac27ca1fa049]
aws_internet_gateway.rdx_internet_gateway: Refreshing state... [id=igw-0ae10b0dfbad9fa29]
aws_route_table.rdx_private_route_table: Refreshing state... [id=rtb-0b6e37ef883e2a9b6]
aws_subnet.rdx_private_subnet[1]: Refreshing state... [id=subnet-0d23844f7d5e4a851]
aws_security_group.rdx_public_security_group: Refreshing state... [id=sg-04f25d8bf49a784be]
aws_route_table.rdx_public_route_table: Refreshing state... [id=rtb-0c962ab882059ed67]
aws_security_group_rule.rdx_public_security_group_rules_ingress[0]: Refreshing state... [id=sgrule-2221829448]
aws_security_group_rule.rdx_private_security_group_rules[0]: Refreshing state... [id=sgrule-702189437]
aws_security_group_rule.rdx_public_security_group_rules_ingress[2]: Refreshing state... [id=sgrule-1887156502]
aws_security_group_rule.rdx_public_security_group_rules_ingress[1]: Refreshing state... [id=sgrule-3439511454]
aws_security_group_rule.rdx_public_security_group_rules_egress[0]: Refreshing state... [id=sgrule-1403434119]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-043db498032daca52]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-07954d7088027aed9]
aws_db_subnet_group.rdx_private_subnet_group: Refreshing state... [id=rdx_private_subnet_group]
aws_eip.fullnode_ips[0]: Refreshing state... [id=eipalloc-0500f018d12e561e6]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-09bb72b8516db86c9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eip.fullnode_ips[0] will be updated in-place
  ~ resource "aws_eip" "fullnode_ips" {
        id                   = "eipalloc-0500f018d12e561e6"
      + instance             = (known after apply)
        tags                 = {
            "Name" = "Full Node IP 1"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_instance.full_node_ec2[0] will be created
  + resource "aws_instance" "full_node_ec2" {
      + ami                                  = "ami-0778521d914d23bc1"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rdx-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0f213ac27ca1fa049"
      + tags                                 = {
          + "Name" = "Full Node 1"
        }
      + tags_all                             = {
          + "Name" = "Full Node 1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-04f25d8bf49a784be",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Pushed by: @StatelessOddity, Action: `pull_request`*